<p>Ben Trey<br>
SQL Project<br>
Data Science Track<br>
2019/6/26</p>

In [6]:
import sqlite3
from sqlite3 import OperationalError

In [12]:
directory = '/mnt/c/users/我的电脑/Desktop/springboard/'
country_club = sqlite3.connect(directory+'country_club.db') 
country_cursor = country_club.cursor()
commands_file = open(directory+'country_club.sql','r')
commands = commands_file.read()
commands_file.close()
commands_list=commands.split(';')
country_cursor.execute('DROP TABLE Bookings;')
for command in commands_list:
    command += ';'
    try:
        country_cursor.execute(command)
    except OperationalError:
        print(command)

<p>Q1: Some of the facilities charge a fee to members, but some do not.
Please list the names of the facilities that do.</p>

In [23]:
sql_command='''SELECT name FROM facilities WHERE membercost=0.0'''
print(sql_command+'\n')
country_cursor.execute(sql_command)
results=country_cursor.fetchall()
for result in results:
    print(result[0])

SELECT name FROM facilities WHERE membercost=0.0

Badminton Court
Table Tennis
Snooker Table
Pool Table

<p>Q2: How many facilities do not charge a fee to members?</p>

In [22]:
sql_command='''SELECT COUNT(name) FROM facilities WHERE membercost=0.0'''
print(sql_command+'\n')
country_cursor.execute(sql_command)
results=country_cursor.fetchall()
for result in results:
    print(result[0])

SELECT COUNT(name) FROM facilities WHERE membercost=0.0

4

<p>Q3: How can you produce a list of facilities that charge a fee to members,
where the fee is less than 20% of the facility's monthly maintenance cost?
Return the facid, facility name, member cost, and monthly maintenance of the
facilities in question. </p>

In [21]:
sql_command='''SELECT facid, name, membercost, monthlymaintenance 
    FROM facilities WHERE membercost<0.2*monthlymaintenance'''
print(sql_command+'\n')
country_cursor.execute(sql_command)
results=country_cursor.fetchall()
print('(Facility ID, Name, Member Cost, Monthly Maintenance)')
for result in results:
    print(result)

SELECT facid, name, membercost, monthlymaintenance
    FROM facilities WHERE membercost<0.2*monthlymaintenance

(Facility ID, Name, Member Cost, Monthly Maintenance)
(0, 'Tennis Court 1', 5, 200)
(1, 'Tennis Court 2', 5, 200)
(2, 'Badminton Court', 0, 50)
(3, 'Table Tennis', 0, 10)
(4, 'Massage Room 1', 9.9, 3000)
(5, 'Massage Room 2', 9.9, 3000)
(6, 'Squash Court', 3.5, 80)
(7, 'Snooker Table', 0, 15)
(8, 'Pool Table', 0, 15)

<p>Q4: How can you retrieve the details of facilities with ID 1 and 5?
Write the query without using the OR operator. </p>

In [27]:
sql_command='''SELECT facid, name FROM facilities WHERE facid IN (1,5)'''
print(sql_command+'\n')
country_cursor.execute(sql_command)
results=country_cursor.fetchall()
for result in results:
    print(result)

SELECT facid, name FROM facilities WHERE facid IN (1,5)

(1, 'Tennis Court 2')
(5, 'Massage Room 2')

<p>Q5: How can you produce a list of facilities, with each labelled as
'cheap' or 'expensive', depending on if their monthly maintenance cost is
more than $100? Return the name and monthly maintenance of the facilities
in question.</p>

In [29]:
sql_command='''SELECT name,
       CASE WHEN monthlymaintenance < 100 THEN 'yes'
            ELSE 'no' END AS cheap
  FROM facilities'''
print(sql_command+'\n')
country_cursor.execute(sql_command)
results=country_cursor.fetchall()
for result in results:
    print(result)

SELECT name,
       CASE WHEN monthlymaintenance < 100 THEN 'yes'
            ELSE 'no' END AS cheap
  FROM facilities

('Tennis Court 1', 'no')
('Tennis Court 2', 'no')
('Badminton Court', 'yes')
('Table Tennis', 'yes')
('Massage Room 1', 'no')
('Massage Room 2', 'no')
('Squash Court', 'yes')
('Snooker Table', 'yes')
('Pool Table', 'yes')

<p>Q6: You'd like to get the first and last name of the last member(s)
who signed up. Do not use the LIMIT clause for your solution.</p>

In [37]:
sql_command='''SELECT firstname, surname, MAX(joindate) AS max_joindate FROM Members;'''
print(sql_command+'\n')
country_cursor.execute(sql_command)
results=country_cursor.fetchall()
for result in results:
    print(result)

SELECT firstname, surname, MAX(joindate) AS max_joindate FROM Members;

('Darren', 'Smith', '2012-09-26 18:08:45')

<p>Q7: How can you produce a list of all members who have used a tennis court?
Include in your output the name of the court, and the name of the member
formatted as a single column. Ensure no duplicate data, and order by
the member name.</p>

In [69]:
sql_command='''SELECT DISTINCT Members.surname || ', ' || Members.firstname || ' ' ||
  Facilities.name AS result
FROM Bookings
LEFT JOIN Members
  ON Bookings.memid = Members.memid
LEFT JOIN Facilities
  ON Bookings.facid = Facilities.facid
WHERE Bookings.facid=0 OR Bookings.facid=1
ORDER BY Members.surname, Members.firstname;'''
print(sql_command+'\n')
country_cursor.execute(sql_command)
results=country_cursor.fetchall()
for result in results:
    print(result[0])

SELECT DISTINCT Members.surname || ', ' || Members.firstname || ' ' ||
  Facilities.name AS result
FROM Bookings
LEFT JOIN Members
  ON Bookings.memid = Members.memid
LEFT JOIN Facilities
  ON Bookings.facid = Facilities.facid
WHERE Bookings.facid=0 OR Bookings.facid=1
ORDER BY Members.surname, Members.firstname;

Bader, Florence Tennis Court 2
Bader, Florence Tennis Court 1
Baker, Anne Tennis Court 1
Baker, Anne Tennis Court 2
Baker, Timothy Tennis Court 2
Baker, Timothy Tennis Court 1
Boothe, Tim Tennis Court 2
Boothe, Tim Tennis Court 1
Butters, Gerald Tennis Court 1
Butters, Gerald Tennis Court 2
Coplin, Joan Tennis Court 1
Crumpet, Erica Tennis Court 1
Dare, Nancy Tennis Court 2
Dare, Nancy Tennis Court 1
Farrell, David Tennis Court 1
Farrell, David Tennis Court 2
Farrell, Jemima Tennis Court 2
Farrell, Jemima Tennis Court 1
GUEST, GUEST Tennis Court 2
GUEST, GUEST Tennis Court 1
Genting, Matthew Tennis Court 1
Hunt, John Tennis Court 1
Hunt, John Tennis Court 2
Jones, David Tennis Court 2
Jones, David Tennis Court 1
Jones, Douglas Tennis Court 1
Joplette, Janice Tennis Court 1
Joplette, Janice Tennis Court 2
Owen, Charles Tennis Court 1
Owen, Charles Tennis Court 2
Pinker, David Tennis Court 1
Purview, Millicent Tennis Court 2
Rownam, Tim Tennis Court 2
Rownam, Tim Tennis Court 1
Rumney, Henrietta Tennis Court 2
Sarwin, Ramnaresh Tennis Court 2
Sarwin, Ramnaresh Tennis Court 1
Smith, Darren Tennis Court 2
Smith, Jack Tennis Court 1
Smith, Jack Tennis Court 2
Smith, Tracy Tennis Court 1
Smith, Tracy Tennis Court 2
Stibbons, Ponder Tennis Court 2
Stibbons, Ponder Tennis Court 1
Tracy, Burton Tennis Court 2
Tracy, Burton Tennis Court 1

<p>Q8: How can you produce a list of bookings on the day of 2012-09-14 which
will cost the member (or guest) more than $30? Remember that guests have
different costs to members (the listed costs are per half-hour 'slot'), and
the guest user's ID is always 0. Include in your output the name of the
facility, the name of the member formatted as a single column, and the cost.
Order by descending cost, and do not use any subqueries.</p>

In [119]:
sql_commands=[\
'''DROP TABLE users_bookings;''',\
              
'''CREATE TABLE users_bookings AS SELECT Members.surname, Members.firstname, Facilities.name, 
  Facilities.membercost, Facilities.guestcost
FROM Bookings
LEFT JOIN Members
  ON Bookings.memid = Members.memid
LEFT JOIN Facilities
  ON Bookings.facid = Facilities.facid
WHERE DATE(Bookings.starttime)='2012-09-14';''',\
              
'''SELECT  name || ', ' || surname || ', ' || firstname || ', ', 
CASE WHEN name='GUEST' THEN guestcost
ELSE membercost END AS cost
FROM users_bookings
ORDER BY cost DESC;''']

for sql_command in sql_commands:
    print(sql_command+'\n')
    country_cursor.execute(sql_command)
results=country_cursor.fetchall()
for result in results:
    print(result)

DROP TABLE users_bookings;

CREATE TABLE users_bookings AS SELECT Members.surname, Members.firstname, Facilities.name,
  Facilities.membercost, Facilities.guestcost
FROM Bookings
LEFT JOIN Members
  ON Bookings.memid = Members.memid
LEFT JOIN Facilities
  ON Bookings.facid = Facilities.facid
WHERE DATE(Bookings.starttime)='2012-09-14';

SELECT  name || ', ' || surname || ', ' || firstname || ', ',
CASE WHEN name='GUEST' THEN guestcost
ELSE membercost END AS cost
FROM users_bookings
ORDER BY cost DESC;

('Massage Room 1, Smith, Jack, ', 9.9)
('Massage Room 1, GUEST, GUEST, ', 9.9)
('Massage Room 1, Farrell, Jemima, ', 9.9)
('Massage Room 1, Stibbons, Ponder, ', 9.9)
('Massage Room 1, GUEST, GUEST, ', 9.9)
('Massage Room 1, Farrell, Jemima, ', 9.9)
('Massage Room 1, GUEST, GUEST, ', 9.9)
('Massage Room 1, Tracy, Burton, ', 9.9)
('Massage Room 1, Genting, Matthew, ', 9.9)
('Massage Room 2, Bader, Florence, ', 9.9)
('Massage Room 2, GUEST, GUEST, ', 9.9)
('Tennis Court 1, Tracy, Burton, ', 5)
('Tennis Court 1, Pinker, David, ', 5)
('Tennis Court 1, Butters, Gerald, ', 5)
('Tennis Court 1, Rownam, Tim, ', 5)
('Tennis Court 1, GUEST, GUEST, ', 5)
('Tennis Court 1, Jones, Douglas, ', 5)
('Tennis Court 1, GUEST, GUEST, ', 5)
('Tennis Court 2, Jones, David, ', 5)
('Tennis Court 2, Boothe, Tim, ', 5)
('Tennis Court 2, GUEST, GUEST, ', 5)
('Tennis Court 2, GUEST, GUEST, ', 5)
('Squash Court, Baker, Anne, ', 3.5)
('Squash Court, GUEST, GUEST, ', 3.5)
('Squash Court, GUEST, GUEST, ', 3.5)
('Squash Court, Baker, Timothy, ', 3.5)
('Squash Court, GUEST, GUEST, ', 3.5)
('Squash Court, Baker, Anne, ', 3.5)
('Squash Court, Pinker, David, ', 3.5)
('Badminton Court, Smith, Darren, ', 0)
('Badminton Court, Mackenzie, Anna, ', 0)
('Badminton Court, Smith, Darren, ', 0)
('Badminton Court, Butters, Gerald, ', 0)
('Badminton Court, Stibbons, Ponder, ', 0)
('Table Tennis, Bader, Florence, ', 0)
('Table Tennis, Baker, Timothy, ', 0)
('Table Tennis, Genting, Matthew, ', 0)
('Table Tennis, Mackenzie, Anna, ', 0)
('Snooker Table, Owen, Charles, ', 0)
('Snooker Table, Sarwin, Ramnaresh, ', 0)
('Snooker Table, Stibbons, Ponder, ', 0)
('Snooker Table, Mackenzie, Anna, ', 0)
('Snooker Table, Sarwin, Ramnaresh, ', 0)
('Pool Table, Rownam, Tim, ', 0)
('Pool Table, Baker, Timothy, ', 0)
('Pool Table, Smith, Tracy, ', 0)
('Pool Table, Mackenzie, Anna, ', 0)
('Pool Table, Rownam, Tim, ', 0)
('Pool Table, Stibbons, Ponder, ', 0)
('Pool Table, Rownam, Tim, ', 0)
('Pool Table, Genting, Matthew, ', 0)
('Pool Table, Mackenzie, Anna, ', 0)
('Pool Table, Baker, Timothy, ', 0)
('Pool Table, Sarwin, Ramnaresh, ', 0)
('Pool Table, Genting, Matthew, ', 0)
('Pool Table, Coplin, Joan, ', 0)
('Pool Table, Baker, Timothy, ', 0)
('Pool Table, Rownam, Tim, ', 0)
('Pool Table, Bader, Florence, ', 0)
('Pool Table, Baker, Timothy, ', 0)
('Pool Table, Jones, David, ', 0)
('Pool Table, Smith, Tracy, ', 0)

<p>Q9: This time, produce the same result as in Q8, but using a subquery.</p>

In [120]:
sql_commands=[\
'''DROP TABLE users_bookings;''',\
                            
'''SELECT  name || ', ' || surname || ', ' || firstname || ', ', 
CASE WHEN name='GUEST' THEN guestcost
ELSE membercost END AS cost
FROM (SELECT Members.surname, Members.firstname, Facilities.name, 
  Facilities.membercost, Facilities.guestcost
FROM Bookings
LEFT JOIN Members
  ON Bookings.memid = Members.memid
LEFT JOIN Facilities
  ON Bookings.facid = Facilities.facid
WHERE DATE(Bookings.starttime)='2012-09-14')
ORDER BY cost DESC;''']

for sql_command in sql_commands:
    print(sql_command+'\n')
    country_cursor.execute(sql_command)
results=country_cursor.fetchall()
for result in results:
    print(result)

DROP TABLE users_bookings;

SELECT  name || ', ' || surname || ', ' || firstname || ', ',
CASE WHEN name='GUEST' THEN guestcost
ELSE membercost END AS cost
FROM (SELECT Members.surname, Members.firstname, Facilities.name,
  Facilities.membercost, Facilities.guestcost
FROM Bookings
LEFT JOIN Members
  ON Bookings.memid = Members.memid
LEFT JOIN Facilities
  ON Bookings.facid = Facilities.facid
WHERE DATE(Bookings.starttime)='2012-09-14')
ORDER BY cost DESC;

('Massage Room 1, Smith, Jack, ', 9.9)
('Massage Room 1, GUEST, GUEST, ', 9.9)
('Massage Room 1, Farrell, Jemima, ', 9.9)
('Massage Room 1, Stibbons, Ponder, ', 9.9)
('Massage Room 1, GUEST, GUEST, ', 9.9)
('Massage Room 1, Farrell, Jemima, ', 9.9)
('Massage Room 1, GUEST, GUEST, ', 9.9)
('Massage Room 1, Tracy, Burton, ', 9.9)
('Massage Room 1, Genting, Matthew, ', 9.9)
('Massage Room 2, Bader, Florence, ', 9.9)
('Massage Room 2, GUEST, GUEST, ', 9.9)
('Tennis Court 1, Tracy, Burton, ', 5)
('Tennis Court 1, Pinker, David, ', 5)
('Tennis Court 1, Butters, Gerald, ', 5)
('Tennis Court 1, Rownam, Tim, ', 5)
('Tennis Court 1, GUEST, GUEST, ', 5)
('Tennis Court 1, Jones, Douglas, ', 5)
('Tennis Court 1, GUEST, GUEST, ', 5)
('Tennis Court 2, Jones, David, ', 5)
('Tennis Court 2, Boothe, Tim, ', 5)
('Tennis Court 2, GUEST, GUEST, ', 5)
('Tennis Court 2, GUEST, GUEST, ', 5)
('Squash Court, Baker, Anne, ', 3.5)
('Squash Court, GUEST, GUEST, ', 3.5)
('Squash Court, GUEST, GUEST, ', 3.5)
('Squash Court, Baker, Timothy, ', 3.5)
('Squash Court, GUEST, GUEST, ', 3.5)
('Squash Court, Baker, Anne, ', 3.5)
('Squash Court, Pinker, David, ', 3.5)
('Badminton Court, Smith, Darren, ', 0)
('Badminton Court, Mackenzie, Anna, ', 0)
('Badminton Court, Smith, Darren, ', 0)
('Badminton Court, Butters, Gerald, ', 0)
('Badminton Court, Stibbons, Ponder, ', 0)
('Table Tennis, Bader, Florence, ', 0)
('Table Tennis, Baker, Timothy, ', 0)
('Table Tennis, Genting, Matthew, ', 0)
('Table Tennis, Mackenzie, Anna, ', 0)
('Snooker Table, Owen, Charles, ', 0)
('Snooker Table, Sarwin, Ramnaresh, ', 0)
('Snooker Table, Stibbons, Ponder, ', 0)
('Snooker Table, Mackenzie, Anna, ', 0)
('Snooker Table, Sarwin, Ramnaresh, ', 0)
('Pool Table, Rownam, Tim, ', 0)
('Pool Table, Baker, Timothy, ', 0)
('Pool Table, Smith, Tracy, ', 0)
('Pool Table, Mackenzie, Anna, ', 0)
('Pool Table, Rownam, Tim, ', 0)
('Pool Table, Stibbons, Ponder, ', 0)
('Pool Table, Rownam, Tim, ', 0)
('Pool Table, Genting, Matthew, ', 0)
('Pool Table, Mackenzie, Anna, ', 0)
('Pool Table, Baker, Timothy, ', 0)
('Pool Table, Sarwin, Ramnaresh, ', 0)
('Pool Table, Genting, Matthew, ', 0)
('Pool Table, Coplin, Joan, ', 0)
('Pool Table, Baker, Timothy, ', 0)
('Pool Table, Rownam, Tim, ', 0)
('Pool Table, Bader, Florence, ', 0)
('Pool Table, Baker, Timothy, ', 0)
('Pool Table, Jones, David, ', 0)
('Pool Table, Smith, Tracy, ', 0)

<p> Q10: Produce a list of facilities with a total revenue less than 1000.
The output of facility name and total revenue, sorted by revenue. Remember
that there's a different cost for guests and members!</p>

In [138]:
sql_commands=[\
'''DROP TABLE users_bookings;''',\
'''DROP TABLE facilities_revenue;''',\
'''DROP TABLE total_revenues;''',\
              
'''CREATE TABLE users_bookings AS SELECT Members.surname, Members.firstname, Facilities.name, 
  Facilities.membercost, Facilities.guestcost
FROM Bookings
LEFT JOIN Members
  ON Bookings.memid = Members.memid
LEFT JOIN Facilities
  ON Bookings.facid = Facilities.facid;''',\
              
'''CREATE TABLE facilities_revenue AS SELECT name,
CASE WHEN name='GUEST' THEN guestcost
ELSE membercost END AS revenue
FROM users_bookings;''',\

'''CREATE TABLE total_revenues AS SELECT name,
SUM(revenue) as total_revenue
FROM facilities_revenue
GROUP BY name''',\

'''SELECT name,total_revenue
FROM total_revenues 
WHERE total_revenue<1000
ORDER BY total_revenue''']

for sql_command in sql_commands:
    print(sql_command+'\n')
    country_cursor.execute(sql_command)
results=country_cursor.fetchall()
for result in results:
    print(result)

DROP TABLE users_bookings;

DROP TABLE facilities_revenue;

DROP TABLE total_revenues;

CREATE TABLE users_bookings AS SELECT Members.surname, Members.firstname, Facilities.name,
  Facilities.membercost, Facilities.guestcost
FROM Bookings
LEFT JOIN Members
  ON Bookings.memid = Members.memid
LEFT JOIN Facilities
  ON Bookings.facid = Facilities.facid;

CREATE TABLE facilities_revenue AS SELECT name,
CASE WHEN name='GUEST' THEN guestcost
ELSE membercost END AS revenue
FROM users_bookings;

CREATE TABLE total_revenues AS SELECT name,
SUM(revenue) as total_revenue
FROM facilities_revenue
GROUP BY name

SELECT name,total_revenue
FROM total_revenues
WHERE total_revenue<1000
ORDER BY total_revenue

('Badminton Court', 0)
('Pool Table', 0)
('Snooker Table', 0)
('Table Tennis', 0)